---
kind: method
id: M:Autodesk.Revit.DB.BoundingBoxIsInsideFilter.GetBoundingBox
source: html/711f34fc-b170-5527-7fe1-b1b925000ce5.htm
---
# Autodesk.Revit.DB.BoundingBoxIsInsideFilter.GetBoundingBox Method

Gets the outline being used for this filter.

## Syntax (C#)
```csharp
public Outline GetBoundingBox()
```

## Returns
The outline being used for this filter.